7767517
510 615
Input            images                   0 1 images
MemoryData       /model.24/Constant_101_output_0 0 1 /model.24/Constant_101_output_0 0=2
MemoryData       /model.24/Constant_106_output_0 0 1 /model.24/Constant_106_output_0 0=2
MemoryData       /model.24/Constant_107_output_0 0 1 /model.24/Constant_107_output_0 0=1
MemoryData       /model.24/Constant_11_output_0 0 1 /model.24/Constant_11_output_0 0=1
MemoryData       /model.24/Constant_12_output_0 0 1 /model.24/Constant_12_output_0 0=1
MemoryData       /model.24/Constant_13_output_0 0 1 /model.24/Constant_13_output_0 0=1
MemoryData       /model.24/Constant_14_output_0 0 1 /model.24/Constant_14_output_0 0=1
MemoryData       /model.24/Constant_15_output_0 0 1 /model.24/Constant_15_output_0 0=1
MemoryData       /model.24/Constant_16_output_0 0 1 /model.24/Constant_16_output_0 0=1
MemoryData       /model.24/Constant_17_output_0 0 1 /model.24/Constant_17_output_0 0=1
MemoryData       /model.24/Constant_18_output_0 0 1 /model.24/Constant_18_output_0 0=1
MemoryData       /model.24/Constant_19_output_0 0 1 /model.24/Constant_19_output_0 0=1
MemoryData       /model.24/Constant_21_output_0 0 1 /model.24/Constant_21_output_0 0=2
MemoryData       /model.24/Constant_23_output_0 0 1 /model.24/Constant_23_output_0 0=1
MemoryData       /model.24/Constant_24_output_0 0 1 /model.24/Constant_24_output_0 0=1
MemoryData       /model.24/Constant_25_output_0 0 1 /model.24/Constant_25_output_0 0=1
MemoryData       /model.24/Constant_26_output_0 0 1 /model.24/Constant_26_output_0 0=1
MemoryData       /model.24/Constant_27_output_0 0 1 /model.24/Constant_27_output_0 0=1
MemoryData       /model.24/Constant_29_output_0 0 1 /model.24/Constant_29_output_0 0=2
MemoryData       /model.24/Constant_34_output_0 0 1 /model.24/Constant_34_output_0 0=2
MemoryData       /model.24/Constant_35_output_0 0 1 /model.24/Constant_35_output_0 0=1
MemoryData       /model.24/Constant_39_output_0 0 1 /model.24/Constant_39_output_0 0=1
MemoryData       /model.24/Constant_3_output_0 0 1 /model.24/Constant_3_output_0 0=1
MemoryData       /model.24/Constant_40_output_0 0 1 /model.24/Constant_40_output_0 0=1
MemoryData       /model.24/Constant_41_output_0 0 1 /model.24/Constant_41_output_0 0=1
MemoryData       /model.24/Constant_42_output_0 0 1 /model.24/Constant_42_output_0 0=1
MemoryData       /model.24/Constant_43_output_0 0 1 /model.24/Constant_43_output_0 0=1
MemoryData       /model.24/Constant_44_output_0 0 1 /model.24/Constant_44_output_0 0=1
MemoryData       /model.24/Constant_47_output_0 0 1 /model.24/Constant_47_output_0 0=1
MemoryData       /model.24/Constant_48_output_0 0 1 /model.24/Constant_48_output_0 0=1
MemoryData       /model.24/Constant_49_output_0 0 1 /model.24/Constant_49_output_0 0=1
MemoryData       /model.24/Constant_4_output_0 0 1 /model.24/Constant_4_output_0 0=1
MemoryData       /model.24/Constant_50_output_0 0 1 /model.24/Constant_50_output_0 0=1
MemoryData       /model.24/Constant_51_output_0 0 1 /model.24/Constant_51_output_0 0=1
MemoryData       /model.24/Constant_52_output_0 0 1 /model.24/Constant_52_output_0 0=1
MemoryData       /model.24/Constant_53_output_0 0 1 /model.24/Constant_53_output_0 0=1
MemoryData       /model.24/Constant_54_output_0 0 1 /model.24/Constant_54_output_0 0=1
MemoryData       /model.24/Constant_55_output_0 0 1 /model.24/Constant_55_output_0 0=1
MemoryData       /model.24/Constant_57_output_0 0 1 /model.24/Constant_57_output_0 0=2
MemoryData       /model.24/Constant_59_output_0 0 1 /model.24/Constant_59_output_0 0=1
MemoryData       /model.24/Constant_5_output_0 0 1 /model.24/Constant_5_output_0 0=1
MemoryData       /model.24/Constant_60_output_0 0 1 /model.24/Constant_60_output_0 0=1
MemoryData       /model.24/Constant_61_output_0 0 1 /model.24/Constant_61_output_0 0=1
MemoryData       /model.24/Constant_62_output_0 0 1 /model.24/Constant_62_output_0 0=1
MemoryData       /model.24/Constant_63_output_0 0 1 /model.24/Constant_63_output_0 0=1
MemoryData       /model.24/Constant_65_output_0 0 1 /model.24/Constant_65_output_0 0=2
MemoryData       /model.24/Constant_6_output_0 0 1 /model.24/Constant_6_output_0 0=1
MemoryData       /model.24/Constant_70_output_0 0 1 /model.24/Constant_70_output_0 0=2
MemoryData       /model.24/Constant_71_output_0 0 1 /model.24/Constant_71_output_0 0=1
MemoryData       /model.24/Constant_75_output_0 0 1 /model.24/Constant_75_output_0 0=1
MemoryData       /model.24/Constant_76_output_0 0 1 /model.24/Constant_76_output_0 0=1
MemoryData       /model.24/Constant_77_output_0 0 1 /model.24/Constant_77_output_0 0=1
MemoryData       /model.24/Constant_78_output_0 0 1 /model.24/Constant_78_output_0 0=1
MemoryData       /model.24/Constant_79_output_0 0 1 /model.24/Constant_79_output_0 0=1
MemoryData       /model.24/Constant_7_output_0 0 1 /model.24/Constant_7_output_0 0=1
MemoryData       /model.24/Constant_80_output_0 0 1 /model.24/Constant_80_output_0 0=1
MemoryData       /model.24/Constant_83_output_0 0 1 /model.24/Constant_83_output_0 0=1
MemoryData       /model.24/Constant_84_output_0 0 1 /model.24/Constant_84_output_0 0=1
MemoryData       /model.24/Constant_85_output_0 0 1 /model.24/Constant_85_output_0 0=1
MemoryData       /model.24/Constant_86_output_0 0 1 /model.24/Constant_86_output_0 0=1
MemoryData       /model.24/Constant_87_output_0 0 1 /model.24/Constant_87_output_0 0=1
MemoryData       /model.24/Constant_88_output_0 0 1 /model.24/Constant_88_output_0 0=1
MemoryData       /model.24/Constant_89_output_0 0 1 /model.24/Constant_89_output_0 0=1
MemoryData       /model.24/Constant_8_output_0 0 1 /model.24/Constant_8_output_0 0=1
MemoryData       /model.24/Constant_90_output_0 0 1 /model.24/Constant_90_output_0 0=1
MemoryData       /model.24/Constant_91_output_0 0 1 /model.24/Constant_91_output_0 0=1
MemoryData       /model.24/Constant_93_output_0 0 1 /model.24/Constant_93_output_0 0=2
MemoryData       /model.24/Constant_95_output_0 0 1 /model.24/Constant_95_output_0 0=1
MemoryData       /model.24/Constant_96_output_0 0 1 /model.24/Constant_96_output_0 0=1
MemoryData       /model.24/Constant_97_output_0 0 1 /model.24/Constant_97_output_0 0=1
MemoryData       /model.24/Constant_98_output_0 0 1 /model.24/Constant_98_output_0 0=1
MemoryData       /model.24/Constant_99_output_0 0 1 /model.24/Constant_99_output_0 0=1
MemoryData       onnx::Expand_747         0 1 onnx::Expand_747
MemoryData       onnx::Expand_759         0 1 onnx::Expand_759
MemoryData       onnx::Expand_771         0 1 onnx::Expand_771
MemoryData       onnx::Split_452          0 1 onnx::Split_452 0=4
Split            splitncnn_0              1 3 onnx::Split_452 onnx::Split_452_splitncnn_0 onnx::Split_452_splitncnn_1 onnx::Split_452_splitncnn_2
MemoryData       onnx::Unsqueeze_364      0 1 onnx::Unsqueeze_364 0=1
MemoryData       onnx::Unsqueeze_370      0 1 onnx::Unsqueeze_370 0=1
MemoryData       onnx::Unsqueeze_372      0 1 onnx::Unsqueeze_372 0=1
MemoryData       onnx::Unsqueeze_474      0 1 onnx::Unsqueeze_474 0=1
MemoryData       onnx::Unsqueeze_476      0 1 onnx::Unsqueeze_476 0=1
MemoryData       onnx::Unsqueeze_492      0 1 onnx::Unsqueeze_492 0=1
MemoryData       onnx::Unsqueeze_498      0 1 onnx::Unsqueeze_498 0=1
MemoryData       onnx::Unsqueeze_500      0 1 onnx::Unsqueeze_500 0=1
MemoryData       onnx::Unsqueeze_601      0 1 onnx::Unsqueeze_601 0=1
MemoryData       onnx::Unsqueeze_603      0 1 onnx::Unsqueeze_603 0=1
MemoryData       onnx::Unsqueeze_619      0 1 onnx::Unsqueeze_619 0=1
MemoryData       onnx::Unsqueeze_625      0 1 onnx::Unsqueeze_625 0=1
MemoryData       onnx::Unsqueeze_627      0 1 onnx::Unsqueeze_627 0=1
MemoryData       onnx::Unsqueeze_728      0 1 onnx::Unsqueeze_728 0=1
MemoryData       onnx::Unsqueeze_730      0 1 onnx::Unsqueeze_730 0=1
Convolution      /model.0/conv/Conv       1 1 images /model.0/conv/Conv_output_0 0=16 1=6 11=6 2=1 12=1 3=2 13=2 4=2 14=2 15=2 16=2 5=1 6=1728
Swish            /model.0/act/Mul         1 1 /model.0/conv/Conv_output_0 /model.0/act/Mul_output_0
Convolution      /model.1/conv/Conv       1 1 /model.0/act/Mul_output_0 /model.1/conv/Conv_output_0 0=32 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=4608
Swish            /model.1/act/Mul         1 1 /model.1/conv/Conv_output_0 /model.1/act/Mul_output_0
Split            splitncnn_1              1 2 /model.1/act/Mul_output_0 /model.1/act/Mul_output_0_splitncnn_0 /model.1/act/Mul_output_0_splitncnn_1
Convolution      /model.2/cv1/conv/Conv   1 1 /model.1/act/Mul_output_0_splitncnn_1 /model.2/cv1/conv/Conv_output_0 0=16 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=512
Swish            /model.2/cv1/act/Mul     1 1 /model.2/cv1/conv/Conv_output_0 /model.2/cv1/act/Mul_output_0
Split            splitncnn_2              1 2 /model.2/cv1/act/Mul_output_0 /model.2/cv1/act/Mul_output_0_splitncnn_0 /model.2/cv1/act/Mul_output_0_splitncnn_1
Convolution      /model.2/m/m.0/cv1/conv/Conv 1 1 /model.2/cv1/act/Mul_output_0_splitncnn_1 /model.2/m/m.0/cv1/conv/Conv_output_0 0=16 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=256
Swish            /model.2/m/m.0/cv1/act/Mul 1 1 /model.2/m/m.0/cv1/conv/Conv_output_0 /model.2/m/m.0/cv1/act/Mul_output_0
Convolution      /model.2/m/m.0/cv2/conv/Conv 1 1 /model.2/m/m.0/cv1/act/Mul_output_0 /model.2/m/m.0/cv2/conv/Conv_output_0 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=2304
Swish            /model.2/m/m.0/cv2/act/Mul 1 1 /model.2/m/m.0/cv2/conv/Conv_output_0 /model.2/m/m.0/cv2/act/Mul_output_0
BinaryOp         /model.2/m/m.0/Add       2 1 /model.2/cv1/act/Mul_output_0_splitncnn_0 /model.2/m/m.0/cv2/act/Mul_output_0 /model.2/m/m.0/Add_output_0 0=0
Convolution      /model.2/cv2/conv/Conv   1 1 /model.1/act/Mul_output_0_splitncnn_0 /model.2/cv2/conv/Conv_output_0 0=16 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=512
Swish            /model.2/cv2/act/Mul     1 1 /model.2/cv2/conv/Conv_output_0 /model.2/cv2/act/Mul_output_0
Concat           /model.2/Concat          2 1 /model.2/m/m.0/Add_output_0 /model.2/cv2/act/Mul_output_0 /model.2/Concat_output_0 0=0
Convolution      /model.2/cv3/conv/Conv   1 1 /model.2/Concat_output_0 /model.2/cv3/conv/Conv_output_0 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1024
Swish            /model.2/cv3/act/Mul     1 1 /model.2/cv3/conv/Conv_output_0 /model.2/cv3/act/Mul_output_0
Convolution      /model.3/conv/Conv       1 1 /model.2/cv3/act/Mul_output_0 /model.3/conv/Conv_output_0 0=64 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=18432
Swish            /model.3/act/Mul         1 1 /model.3/conv/Conv_output_0 /model.3/act/Mul_output_0
Split            splitncnn_3              1 2 /model.3/act/Mul_output_0 /model.3/act/Mul_output_0_splitncnn_0 /model.3/act/Mul_output_0_splitncnn_1
Convolution      /model.4/cv1/conv/Conv   1 1 /model.3/act/Mul_output_0_splitncnn_1 /model.4/cv1/conv/Conv_output_0 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2048
Swish            /model.4/cv1/act/Mul     1 1 /model.4/cv1/conv/Conv_output_0 /model.4/cv1/act/Mul_output_0
Split            splitncnn_4              1 2 /model.4/cv1/act/Mul_output_0 /model.4/cv1/act/Mul_output_0_splitncnn_0 /model.4/cv1/act/Mul_output_0_splitncnn_1
Convolution      /model.4/m/m.0/cv1/conv/Conv 1 1 /model.4/cv1/act/Mul_output_0_splitncnn_1 /model.4/m/m.0/cv1/conv/Conv_output_0 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1024
Swish            /model.4/m/m.0/cv1/act/Mul 1 1 /model.4/m/m.0/cv1/conv/Conv_output_0 /model.4/m/m.0/cv1/act/Mul_output_0
Convolution      /model.4/m/m.0/cv2/conv/Conv 1 1 /model.4/m/m.0/cv1/act/Mul_output_0 /model.4/m/m.0/cv2/conv/Conv_output_0 0=32 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=9216
Swish            /model.4/m/m.0/cv2/act/Mul 1 1 /model.4/m/m.0/cv2/conv/Conv_output_0 /model.4/m/m.0/cv2/act/Mul_output_0
BinaryOp         /model.4/m/m.0/Add       2 1 /model.4/cv1/act/Mul_output_0_splitncnn_0 /model.4/m/m.0/cv2/act/Mul_output_0 /model.4/m/m.0/Add_output_0 0=0
Split            splitncnn_5              1 2 /model.4/m/m.0/Add_output_0 /model.4/m/m.0/Add_output_0_splitncnn_0 /model.4/m/m.0/Add_output_0_splitncnn_1
Convolution      /model.4/m/m.1/cv1/conv/Conv 1 1 /model.4/m/m.0/Add_output_0_splitncnn_1 /model.4/m/m.1/cv1/conv/Conv_output_0 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1024
Swish            /model.4/m/m.1/cv1/act/Mul 1 1 /model.4/m/m.1/cv1/conv/Conv_output_0 /model.4/m/m.1/cv1/act/Mul_output_0
Convolution      /model.4/m/m.1/cv2/conv/Conv 1 1 /model.4/m/m.1/cv1/act/Mul_output_0 /model.4/m/m.1/cv2/conv/Conv_output_0 0=32 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=9216
Swish            /model.4/m/m.1/cv2/act/Mul 1 1 /model.4/m/m.1/cv2/conv/Conv_output_0 /model.4/m/m.1/cv2/act/Mul_output_0
BinaryOp         /model.4/m/m.1/Add       2 1 /model.4/m/m.0/Add_output_0_splitncnn_0 /model.4/m/m.1/cv2/act/Mul_output_0 /model.4/m/m.1/Add_output_0 0=0
Convolution      /model.4/cv2/conv/Conv   1 1 /model.3/act/Mul_output_0_splitncnn_0 /model.4/cv2/conv/Conv_output_0 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2048
Swish            /model.4/cv2/act/Mul     1 1 /model.4/cv2/conv/Conv_output_0 /model.4/cv2/act/Mul_output_0
Concat           /model.4/Concat          2 1 /model.4/m/m.1/Add_output_0 /model.4/cv2/act/Mul_output_0 /model.4/Concat_output_0 0=0
Convolution      /model.4/cv3/conv/Conv   1 1 /model.4/Concat_output_0 /model.4/cv3/conv/Conv_output_0 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4096
Swish            /model.4/cv3/act/Mul     1 1 /model.4/cv3/conv/Conv_output_0 /model.4/cv3/act/Mul_output_0
Split            splitncnn_6              1 2 /model.4/cv3/act/Mul_output_0 /model.4/cv3/act/Mul_output_0_splitncnn_0 /model.4/cv3/act/Mul_output_0_splitncnn_1
Convolution      /model.5/conv/Conv       1 1 /model.4/cv3/act/Mul_output_0_splitncnn_1 /model.5/conv/Conv_output_0 0=128 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=73728
Swish            /model.5/act/Mul         1 1 /model.5/conv/Conv_output_0 /model.5/act/Mul_output_0
Split            splitncnn_7              1 2 /model.5/act/Mul_output_0 /model.5/act/Mul_output_0_splitncnn_0 /model.5/act/Mul_output_0_splitncnn_1
Convolution      /model.6/cv1/conv/Conv   1 1 /model.5/act/Mul_output_0_splitncnn_1 /model.6/cv1/conv/Conv_output_0 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=8192
Swish            /model.6/cv1/act/Mul     1 1 /model.6/cv1/conv/Conv_output_0 /model.6/cv1/act/Mul_output_0
Split            splitncnn_8              1 2 /model.6/cv1/act/Mul_output_0 /model.6/cv1/act/Mul_output_0_splitncnn_0 /model.6/cv1/act/Mul_output_0_splitncnn_1
Convolution      /model.6/m/m.0/cv1/conv/Conv 1 1 /model.6/cv1/act/Mul_output_0_splitncnn_1 /model.6/m/m.0/cv1/conv/Conv_output_0 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4096
Swish            /model.6/m/m.0/cv1/act/Mul 1 1 /model.6/m/m.0/cv1/conv/Conv_output_0 /model.6/m/m.0/cv1/act/Mul_output_0
Convolution      /model.6/m/m.0/cv2/conv/Conv 1 1 /model.6/m/m.0/cv1/act/Mul_output_0 /model.6/m/m.0/cv2/conv/Conv_output_0 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=36864
Swish            /model.6/m/m.0/cv2/act/Mul 1 1 /model.6/m/m.0/cv2/conv/Conv_output_0 /model.6/m/m.0/cv2/act/Mul_output_0
BinaryOp         /model.6/m/m.0/Add       2 1 /model.6/cv1/act/Mul_output_0_splitncnn_0 /model.6/m/m.0/cv2/act/Mul_output_0 /model.6/m/m.0/Add_output_0 0=0
Split            splitncnn_9              1 2 /model.6/m/m.0/Add_output_0 /model.6/m/m.0/Add_output_0_splitncnn_0 /model.6/m/m.0/Add_output_0_splitncnn_1
Convolution      /model.6/m/m.1/cv1/conv/Conv 1 1 /model.6/m/m.0/Add_output_0_splitncnn_1 /model.6/m/m.1/cv1/conv/Conv_output_0 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4096
Swish            /model.6/m/m.1/cv1/act/Mul 1 1 /model.6/m/m.1/cv1/conv/Conv_output_0 /model.6/m/m.1/cv1/act/Mul_output_0
Convolution      /model.6/m/m.1/cv2/conv/Conv 1 1 /model.6/m/m.1/cv1/act/Mul_output_0 /model.6/m/m.1/cv2/conv/Conv_output_0 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=36864
Swish            /model.6/m/m.1/cv2/act/Mul 1 1 /model.6/m/m.1/cv2/conv/Conv_output_0 /model.6/m/m.1/cv2/act/Mul_output_0
BinaryOp         /model.6/m/m.1/Add       2 1 /model.6/m/m.0/Add_output_0_splitncnn_0 /model.6/m/m.1/cv2/act/Mul_output_0 /model.6/m/m.1/Add_output_0 0=0
Split            splitncnn_10             1 2 /model.6/m/m.1/Add_output_0 /model.6/m/m.1/Add_output_0_splitncnn_0 /model.6/m/m.1/Add_output_0_splitncnn_1
Convolution      /model.6/m/m.2/cv1/conv/Conv 1 1 /model.6/m/m.1/Add_output_0_splitncnn_1 /model.6/m/m.2/cv1/conv/Conv_output_0 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4096
Swish            /model.6/m/m.2/cv1/act/Mul 1 1 /model.6/m/m.2/cv1/conv/Conv_output_0 /model.6/m/m.2/cv1/act/Mul_output_0
Convolution      /model.6/m/m.2/cv2/conv/Conv 1 1 /model.6/m/m.2/cv1/act/Mul_output_0 /model.6/m/m.2/cv2/conv/Conv_output_0 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=36864
Swish            /model.6/m/m.2/cv2/act/Mul 1 1 /model.6/m/m.2/cv2/conv/Conv_output_0 /model.6/m/m.2/cv2/act/Mul_output_0
BinaryOp         /model.6/m/m.2/Add       2 1 /model.6/m/m.1/Add_output_0_splitncnn_0 /model.6/m/m.2/cv2/act/Mul_output_0 /model.6/m/m.2/Add_output_0 0=0
Convolution      /model.6/cv2/conv/Conv   1 1 /model.5/act/Mul_output_0_splitncnn_0 /model.6/cv2/conv/Conv_output_0 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=8192
Swish            /model.6/cv2/act/Mul     1 1 /model.6/cv2/conv/Conv_output_0 /model.6/cv2/act/Mul_output_0
Concat           /model.6/Concat          2 1 /model.6/m/m.2/Add_output_0 /model.6/cv2/act/Mul_output_0 /model.6/Concat_output_0 0=0
Convolution      /model.6/cv3/conv/Conv   1 1 /model.6/Concat_output_0 /model.6/cv3/conv/Conv_output_0 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=16384
Swish            /model.6/cv3/act/Mul     1 1 /model.6/cv3/conv/Conv_output_0 /model.6/cv3/act/Mul_output_0
Split            splitncnn_11             1 2 /model.6/cv3/act/Mul_output_0 /model.6/cv3/act/Mul_output_0_splitncnn_0 /model.6/cv3/act/Mul_output_0_splitncnn_1
Convolution      /model.7/conv/Conv       1 1 /model.6/cv3/act/Mul_output_0_splitncnn_1 /model.7/conv/Conv_output_0 0=256 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=294912
Swish            /model.7/act/Mul         1 1 /model.7/conv/Conv_output_0 /model.7/act/Mul_output_0
Split            splitncnn_12             1 2 /model.7/act/Mul_output_0 /model.7/act/Mul_output_0_splitncnn_0 /model.7/act/Mul_output_0_splitncnn_1
Convolution      /model.8/cv1/conv/Conv   1 1 /model.7/act/Mul_output_0_splitncnn_1 /model.8/cv1/conv/Conv_output_0 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=32768
Swish            /model.8/cv1/act/Mul     1 1 /model.8/cv1/conv/Conv_output_0 /model.8/cv1/act/Mul_output_0
Split            splitncnn_13             1 2 /model.8/cv1/act/Mul_output_0 /model.8/cv1/act/Mul_output_0_splitncnn_0 /model.8/cv1/act/Mul_output_0_splitncnn_1
Convolution      /model.8/m/m.0/cv1/conv/Conv 1 1 /model.8/cv1/act/Mul_output_0_splitncnn_1 /model.8/m/m.0/cv1/conv/Conv_output_0 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=16384
Swish            /model.8/m/m.0/cv1/act/Mul 1 1 /model.8/m/m.0/cv1/conv/Conv_output_0 /model.8/m/m.0/cv1/act/Mul_output_0
Convolution      /model.8/m/m.0/cv2/conv/Conv 1 1 /model.8/m/m.0/cv1/act/Mul_output_0 /model.8/m/m.0/cv2/conv/Conv_output_0 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=147456
Swish            /model.8/m/m.0/cv2/act/Mul 1 1 /model.8/m/m.0/cv2/conv/Conv_output_0 /model.8/m/m.0/cv2/act/Mul_output_0
BinaryOp         /model.8/m/m.0/Add       2 1 /model.8/cv1/act/Mul_output_0_splitncnn_0 /model.8/m/m.0/cv2/act/Mul_output_0 /model.8/m/m.0/Add_output_0 0=0
Convolution      /model.8/cv2/conv/Conv   1 1 /model.7/act/Mul_output_0_splitncnn_0 /model.8/cv2/conv/Conv_output_0 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=32768
Swish            /model.8/cv2/act/Mul     1 1 /model.8/cv2/conv/Conv_output_0 /model.8/cv2/act/Mul_output_0
Concat           /model.8/Concat          2 1 /model.8/m/m.0/Add_output_0 /model.8/cv2/act/Mul_output_0 /model.8/Concat_output_0 0=0
Convolution      /model.8/cv3/conv/Conv   1 1 /model.8/Concat_output_0 /model.8/cv3/conv/Conv_output_0 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=65536
Swish            /model.8/cv3/act/Mul     1 1 /model.8/cv3/conv/Conv_output_0 /model.8/cv3/act/Mul_output_0
Convolution      /model.9/cv1/conv/Conv   1 1 /model.8/cv3/act/Mul_output_0 /model.9/cv1/conv/Conv_output_0 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=32768
Swish            /model.9/cv1/act/Mul     1 1 /model.9/cv1/conv/Conv_output_0 /model.9/cv1/act/Mul_output_0
Split            splitncnn_14             1 2 /model.9/cv1/act/Mul_output_0 /model.9/cv1/act/Mul_output_0_splitncnn_0 /model.9/cv1/act/Mul_output_0_splitncnn_1
Pooling          /model.9/m/MaxPool       1 1 /model.9/cv1/act/Mul_output_0_splitncnn_1 /model.9/m/MaxPool_output_0 0=0 1=5 11=5 2=1 12=1 3=2 13=2 14=2 15=2 5=1
Split            splitncnn_15             1 2 /model.9/m/MaxPool_output_0 /model.9/m/MaxPool_output_0_splitncnn_0 /model.9/m/MaxPool_output_0_splitncnn_1
Pooling          /model.9/m_1/MaxPool     1 1 /model.9/m/MaxPool_output_0_splitncnn_1 /model.9/m_1/MaxPool_output_0 0=0 1=5 11=5 2=1 12=1 3=2 13=2 14=2 15=2 5=1
Split            splitncnn_16             1 2 /model.9/m_1/MaxPool_output_0 /model.9/m_1/MaxPool_output_0_splitncnn_0 /model.9/m_1/MaxPool_output_0_splitncnn_1
Pooling          /model.9/m_2/MaxPool     1 1 /model.9/m_1/MaxPool_output_0_splitncnn_1 /model.9/m_2/MaxPool_output_0 0=0 1=5 11=5 2=1 12=1 3=2 13=2 14=2 15=2 5=1
Concat           /model.9/Concat          4 1 /model.9/cv1/act/Mul_output_0_splitncnn_0 /model.9/m/MaxPool_output_0_splitncnn_0 /model.9/m_1/MaxPool_output_0_splitncnn_0 /model.9/m_2/MaxPool_output_0 /model.9/Concat_output_0 0=0
Convolution      /model.9/cv2/conv/Conv   1 1 /model.9/Concat_output_0 /model.9/cv2/conv/Conv_output_0 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=131072
Swish            /model.9/cv2/act/Mul     1 1 /model.9/cv2/conv/Conv_output_0 /model.9/cv2/act/Mul_output_0
Convolution      /model.10/conv/Conv      1 1 /model.9/cv2/act/Mul_output_0 /model.10/conv/Conv_output_0 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=32768
Swish            /model.10/act/Mul        1 1 /model.10/conv/Conv_output_0 /model.10/act/Mul_output_0
Split            splitncnn_17             1 2 /model.10/act/Mul_output_0 /model.10/act/Mul_output_0_splitncnn_0 /model.10/act/Mul_output_0_splitncnn_1
Interp           /model.11/Resize         1 1 /model.10/act/Mul_output_0_splitncnn_1 /model.11/Resize_output_0 0=1 1=2.000000e+00 2=2.000000e+00 3=0 4=0 6=0
Concat           /model.12/Concat         2 1 /model.11/Resize_output_0 /model.6/cv3/act/Mul_output_0_splitncnn_0 /model.12/Concat_output_0 0=0
Split            splitncnn_18             1 2 /model.12/Concat_output_0 /model.12/Concat_output_0_splitncnn_0 /model.12/Concat_output_0_splitncnn_1
Convolution      /model.13/cv1/conv/Conv  1 1 /model.12/Concat_output_0_splitncnn_1 /model.13/cv1/conv/Conv_output_0 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=16384
Swish            /model.13/cv1/act/Mul    1 1 /model.13/cv1/conv/Conv_output_0 /model.13/cv1/act/Mul_output_0
Convolution      /model.13/m/m.0/cv1/conv/Conv 1 1 /model.13/cv1/act/Mul_output_0 /model.13/m/m.0/cv1/conv/Conv_output_0 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4096
Swish            /model.13/m/m.0/cv1/act/Mul 1 1 /model.13/m/m.0/cv1/conv/Conv_output_0 /model.13/m/m.0/cv1/act/Mul_output_0
Convolution      /model.13/m/m.0/cv2/conv/Conv 1 1 /model.13/m/m.0/cv1/act/Mul_output_0 /model.13/m/m.0/cv2/conv/Conv_output_0 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=36864
Swish            /model.13/m/m.0/cv2/act/Mul 1 1 /model.13/m/m.0/cv2/conv/Conv_output_0 /model.13/m/m.0/cv2/act/Mul_output_0
Convolution      /model.13/cv2/conv/Conv  1 1 /model.12/Concat_output_0_splitncnn_0 /model.13/cv2/conv/Conv_output_0 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=16384
Swish            /model.13/cv2/act/Mul    1 1 /model.13/cv2/conv/Conv_output_0 /model.13/cv2/act/Mul_output_0
Concat           /model.13/Concat         2 1 /model.13/m/m.0/cv2/act/Mul_output_0 /model.13/cv2/act/Mul_output_0 /model.13/Concat_output_0 0=0
Convolution      /model.13/cv3/conv/Conv  1 1 /model.13/Concat_output_0 /model.13/cv3/conv/Conv_output_0 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=16384
Swish            /model.13/cv3/act/Mul    1 1 /model.13/cv3/conv/Conv_output_0 /model.13/cv3/act/Mul_output_0
Convolution      /model.14/conv/Conv      1 1 /model.13/cv3/act/Mul_output_0 /model.14/conv/Conv_output_0 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=8192
Swish            /model.14/act/Mul        1 1 /model.14/conv/Conv_output_0 /model.14/act/Mul_output_0
Split            splitncnn_19             1 2 /model.14/act/Mul_output_0 /model.14/act/Mul_output_0_splitncnn_0 /model.14/act/Mul_output_0_splitncnn_1
Interp           /model.15/Resize         1 1 /model.14/act/Mul_output_0_splitncnn_1 /model.15/Resize_output_0 0=1 1=2.000000e+00 2=2.000000e+00 3=0 4=0 6=0
Concat           /model.16/Concat         2 1 /model.15/Resize_output_0 /model.4/cv3/act/Mul_output_0_splitncnn_0 /model.16/Concat_output_0 0=0
Split            splitncnn_20             1 2 /model.16/Concat_output_0 /model.16/Concat_output_0_splitncnn_0 /model.16/Concat_output_0_splitncnn_1
Convolution      /model.17/cv1/conv/Conv  1 1 /model.16/Concat_output_0_splitncnn_1 /model.17/cv1/conv/Conv_output_0 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4096
Swish            /model.17/cv1/act/Mul    1 1 /model.17/cv1/conv/Conv_output_0 /model.17/cv1/act/Mul_output_0
Convolution      /model.17/m/m.0/cv1/conv/Conv 1 1 /model.17/cv1/act/Mul_output_0 /model.17/m/m.0/cv1/conv/Conv_output_0 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1024
Swish            /model.17/m/m.0/cv1/act/Mul 1 1 /model.17/m/m.0/cv1/conv/Conv_output_0 /model.17/m/m.0/cv1/act/Mul_output_0
Convolution      /model.17/m/m.0/cv2/conv/Conv 1 1 /model.17/m/m.0/cv1/act/Mul_output_0 /model.17/m/m.0/cv2/conv/Conv_output_0 0=32 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=9216
Swish            /model.17/m/m.0/cv2/act/Mul 1 1 /model.17/m/m.0/cv2/conv/Conv_output_0 /model.17/m/m.0/cv2/act/Mul_output_0
Convolution      /model.17/cv2/conv/Conv  1 1 /model.16/Concat_output_0_splitncnn_0 /model.17/cv2/conv/Conv_output_0 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4096
Swish            /model.17/cv2/act/Mul    1 1 /model.17/cv2/conv/Conv_output_0 /model.17/cv2/act/Mul_output_0
Concat           /model.17/Concat         2 1 /model.17/m/m.0/cv2/act/Mul_output_0 /model.17/cv2/act/Mul_output_0 /model.17/Concat_output_0 0=0
Convolution      /model.17/cv3/conv/Conv  1 1 /model.17/Concat_output_0 /model.17/cv3/conv/Conv_output_0 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4096
Swish            /model.17/cv3/act/Mul    1 1 /model.17/cv3/conv/Conv_output_0 /model.17/cv3/act/Mul_output_0
Split            splitncnn_21             1 3 /model.17/cv3/act/Mul_output_0 /model.17/cv3/act/Mul_output_0_splitncnn_0 /model.17/cv3/act/Mul_output_0_splitncnn_1 /model.17/cv3/act/Mul_output_0_splitncnn_2
Convolution      /model.18/conv/Conv      1 1 /model.17/cv3/act/Mul_output_0_splitncnn_2 /model.18/conv/Conv_output_0 0=64 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=36864
Swish            /model.18/act/Mul        1 1 /model.18/conv/Conv_output_0 /model.18/act/Mul_output_0
Concat           /model.19/Concat         2 1 /model.18/act/Mul_output_0 /model.14/act/Mul_output_0_splitncnn_0 /model.19/Concat_output_0 0=0
Split            splitncnn_22             1 2 /model.19/Concat_output_0 /model.19/Concat_output_0_splitncnn_0 /model.19/Concat_output_0_splitncnn_1
Convolution      /model.20/cv1/conv/Conv  1 1 /model.19/Concat_output_0_splitncnn_1 /model.20/cv1/conv/Conv_output_0 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=8192
Swish            /model.20/cv1/act/Mul    1 1 /model.20/cv1/conv/Conv_output_0 /model.20/cv1/act/Mul_output_0
Convolution      /model.20/m/m.0/cv1/conv/Conv 1 1 /model.20/cv1/act/Mul_output_0 /model.20/m/m.0/cv1/conv/Conv_output_0 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4096
Swish            /model.20/m/m.0/cv1/act/Mul 1 1 /model.20/m/m.0/cv1/conv/Conv_output_0 /model.20/m/m.0/cv1/act/Mul_output_0
Convolution      /model.20/m/m.0/cv2/conv/Conv 1 1 /model.20/m/m.0/cv1/act/Mul_output_0 /model.20/m/m.0/cv2/conv/Conv_output_0 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=36864
Swish            /model.20/m/m.0/cv2/act/Mul 1 1 /model.20/m/m.0/cv2/conv/Conv_output_0 /model.20/m/m.0/cv2/act/Mul_output_0
Convolution      /model.20/cv2/conv/Conv  1 1 /model.19/Concat_output_0_splitncnn_0 /model.20/cv2/conv/Conv_output_0 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=8192
Swish            /model.20/cv2/act/Mul    1 1 /model.20/cv2/conv/Conv_output_0 /model.20/cv2/act/Mul_output_0
Concat           /model.20/Concat         2 1 /model.20/m/m.0/cv2/act/Mul_output_0 /model.20/cv2/act/Mul_output_0 /model.20/Concat_output_0 0=0
Convolution      /model.20/cv3/conv/Conv  1 1 /model.20/Concat_output_0 /model.20/cv3/conv/Conv_output_0 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=16384
Swish            /model.20/cv3/act/Mul    1 1 /model.20/cv3/conv/Conv_output_0 /model.20/cv3/act/Mul_output_0
Split            splitncnn_23             1 2 /model.20/cv3/act/Mul_output_0 /model.20/cv3/act/Mul_output_0_splitncnn_0 /model.20/cv3/act/Mul_output_0_splitncnn_1
Convolution      /model.21/conv/Conv      1 1 /model.20/cv3/act/Mul_output_0_splitncnn_1 /model.21/conv/Conv_output_0 0=128 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=147456
Swish            /model.21/act/Mul        1 1 /model.21/conv/Conv_output_0 /model.21/act/Mul_output_0
Concat           /model.22/Concat         2 1 /model.21/act/Mul_output_0 /model.10/act/Mul_output_0_splitncnn_0 /model.22/Concat_output_0 0=0
Split            splitncnn_24             1 2 /model.22/Concat_output_0 /model.22/Concat_output_0_splitncnn_0 /model.22/Concat_output_0_splitncnn_1
Convolution      /model.23/cv1/conv/Conv  1 1 /model.22/Concat_output_0_splitncnn_1 /model.23/cv1/conv/Conv_output_0 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=32768
Swish            /model.23/cv1/act/Mul    1 1 /model.23/cv1/conv/Conv_output_0 /model.23/cv1/act/Mul_output_0
Convolution      /model.23/m/m.0/cv1/conv/Conv 1 1 /model.23/cv1/act/Mul_output_0 /model.23/m/m.0/cv1/conv/Conv_output_0 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=16384
Swish            /model.23/m/m.0/cv1/act/Mul 1 1 /model.23/m/m.0/cv1/conv/Conv_output_0 /model.23/m/m.0/cv1/act/Mul_output_0
Convolution      /model.23/m/m.0/cv2/conv/Conv 1 1 /model.23/m/m.0/cv1/act/Mul_output_0 /model.23/m/m.0/cv2/conv/Conv_output_0 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=147456
Swish            /model.23/m/m.0/cv2/act/Mul 1 1 /model.23/m/m.0/cv2/conv/Conv_output_0 /model.23/m/m.0/cv2/act/Mul_output_0
Convolution      /model.23/cv2/conv/Conv  1 1 /model.22/Concat_output_0_splitncnn_0 /model.23/cv2/conv/Conv_output_0 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=32768
Swish            /model.23/cv2/act/Mul    1 1 /model.23/cv2/conv/Conv_output_0 /model.23/cv2/act/Mul_output_0
Concat           /model.23/Concat         2 1 /model.23/m/m.0/cv2/act/Mul_output_0 /model.23/cv2/act/Mul_output_0 /model.23/Concat_output_0 0=0
Convolution      /model.23/cv3/conv/Conv  1 1 /model.23/Concat_output_0 /model.23/cv3/conv/Conv_output_0 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=65536
Swish            /model.23/cv3/act/Mul    1 1 /model.23/cv3/conv/Conv_output_0 /model.23/cv3/act/Mul_output_0
Convolution      /model.24/proto/cv1/conv/Conv 1 1 /model.17/cv3/act/Mul_output_0_splitncnn_1 /model.24/proto/cv1/conv/Conv_output_0 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=36864
Swish            /model.24/proto/cv1/act/Mul 1 1 /model.24/proto/cv1/conv/Conv_output_0 /model.24/proto/cv1/act/Mul_output_0
Interp           /model.24/proto/upsample/Resize 1 1 /model.24/proto/cv1/act/Mul_output_0 /model.24/proto/upsample/Resize_output_0 0=1 1=2.000000e+00 2=2.000000e+00 3=0 4=0 6=0
Convolution      /model.24/proto/cv2/conv/Conv 1 1 /model.24/proto/upsample/Resize_output_0 /model.24/proto/cv2/conv/Conv_output_0 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=36864
Swish            /model.24/proto/cv2/act/Mul 1 1 /model.24/proto/cv2/conv/Conv_output_0 /model.24/proto/cv2/act/Mul_output_0
Convolution      /model.24/proto/cv3/conv/Conv 1 1 /model.24/proto/cv2/act/Mul_output_0 /model.24/proto/cv3/conv/Conv_output_0 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2048
Swish            /model.24/proto/cv3/act/Mul 1 1 /model.24/proto/cv3/conv/Conv_output_0 output1
Convolution      /model.24/m.0/Conv       1 1 /model.17/cv3/act/Mul_output_0_splitncnn_0 /model.24/m.0/Conv_output_0 0=351 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=22464
Split            splitncnn_25             1 4 /model.24/m.0/Conv_output_0 /model.24/m.0/Conv_output_0_splitncnn_0 /model.24/m.0/Conv_output_0_splitncnn_1 /model.24/m.0/Conv_output_0_splitncnn_2 /model.24/m.0/Conv_output_0_splitncnn_3
Shape            /model.24/Shape          1 1 /model.24/m.0/Conv_output_0_splitncnn_3 /model.24/Shape_output_0
Crop             /model.24/Gather         1 1 /model.24/Shape_output_0 /model.24/Gather_output_0 -23309=1,0 -23310=1,1 -23311=1,-1
Split            splitncnn_26             1 2 /model.24/Gather_output_0 /model.24/Gather_output_0_splitncnn_0 /model.24/Gather_output_0_splitncnn_1
Shape            /model.24/Shape_1        1 1 /model.24/m.0/Conv_output_0_splitncnn_2 /model.24/Shape_1_output_0
Crop             /model.24/Gather_1       1 1 /model.24/Shape_1_output_0 /model.24/Gather_1_output_0 -23309=1,2 -23310=1,3 -23311=1,-1
Split            splitncnn_27             1 5 /model.24/Gather_1_output_0 /model.24/Gather_1_output_0_splitncnn_0 /model.24/Gather_1_output_0_splitncnn_1 /model.24/Gather_1_output_0_splitncnn_2 /model.24/Gather_1_output_0_splitncnn_3 /model.24/Gather_1_output_0_splitncnn_4
Shape            /model.24/Shape_2        1 1 /model.24/m.0/Conv_output_0_splitncnn_1 /model.24/Shape_2_output_0
Crop             /model.24/Gather_2       1 1 /model.24/Shape_2_output_0 /model.24/Gather_2_output_0 -23309=1,3 -23310=1,4 -23311=1,-1
Split            splitncnn_28             1 5 /model.24/Gather_2_output_0 /model.24/Gather_2_output_0_splitncnn_0 /model.24/Gather_2_output_0_splitncnn_1 /model.24/Gather_2_output_0_splitncnn_2 /model.24/Gather_2_output_0_splitncnn_3 /model.24/Gather_2_output_0_splitncnn_4
ExpandDims       /model.24/Unsqueeze      2 1 /model.24/Gather_output_0_splitncnn_1 onnx::Unsqueeze_364 /model.24/Unsqueeze_output_0 -23303=0
ExpandDims       /model.24/Unsqueeze_1    2 1 /model.24/Gather_1_output_0_splitncnn_4 onnx::Unsqueeze_370 /model.24/Unsqueeze_1_output_0 -23303=0
ExpandDims       /model.24/Unsqueeze_2    2 1 /model.24/Gather_2_output_0_splitncnn_4 onnx::Unsqueeze_372 /model.24/Unsqueeze_2_output_0 -23303=0
Concat           /model.24/Concat         5 1 /model.24/Unsqueeze_output_0 /model.24/Constant_3_output_0 /model.24/Constant_4_output_0 /model.24/Unsqueeze_1_output_0 /model.24/Unsqueeze_2_output_0 /model.24/Concat_output_0 0=0
Reshape          /model.24/Reshape        2 1 /model.24/m.0/Conv_output_0_splitncnn_0 /model.24/Concat_output_0 /model.24/Reshape_output_0
Permute          /model.24/Transpose      1 1 /model.24/Reshape_output_0 /model.24/Transpose_output_0 0=1
Cast             /model.24/Cast           1 1 /model.24/Gather_1_output_0_splitncnn_3 /model.24/Cast_output_0
Range            /model.24/Range          3 1 /model.24/Constant_5_output_0 /model.24/Cast_output_0 /model.24/Constant_6_output_0 /model.24/Range_output_0
Cast             /model.24/Cast_1         1 1 /model.24/Gather_2_output_0_splitncnn_3 /model.24/Cast_1_output_0
Range            /model.24/Range_1        3 1 /model.24/Constant_7_output_0 /model.24/Cast_1_output_0 /model.24/Constant_8_output_0 /model.24/Range_1_output_0
Reshape          /model.24/Reshape_1      1 1 /model.24/Range_output_0 /model.24/Reshape_1_output_0 0=-1
Split            splitncnn_29             1 2 /model.24/Reshape_1_output_0 /model.24/Reshape_1_output_0_splitncnn_0 /model.24/Reshape_1_output_0_splitncnn_1
Reshape          /model.24/Reshape_2      1 1 /model.24/Range_1_output_0 /model.24/Reshape_2_output_0 0=-1
Split            splitncnn_30             1 2 /model.24/Reshape_2_output_0 /model.24/Reshape_2_output_0_splitncnn_0 /model.24/Reshape_2_output_0_splitncnn_1
Shape            /model.24/Shape_3        1 1 /model.24/Reshape_1_output_0_splitncnn_1 /model.24/Shape_3_output_0
Split            splitncnn_31             1 2 /model.24/Shape_3_output_0 /model.24/Shape_3_output_0_splitncnn_0 /model.24/Shape_3_output_0_splitncnn_1
Shape            /model.24/Shape_4        1 1 /model.24/Reshape_2_output_0_splitncnn_1 /model.24/Shape_4_output_0
Split            splitncnn_32             1 2 /model.24/Shape_4_output_0 /model.24/Shape_4_output_0_splitncnn_0 /model.24/Shape_4_output_0_splitncnn_1
Concat           /model.24/Concat_1       2 1 /model.24/Shape_3_output_0_splitncnn_1 /model.24/Shape_4_output_0_splitncnn_1 /model.24/Concat_1_output_0 0=0
Split            splitncnn_33             1 2 /model.24/Concat_1_output_0 /model.24/Concat_1_output_0_splitncnn_0 /model.24/Concat_1_output_0_splitncnn_1
Concat           /model.24/Concat_2       2 1 /model.24/Shape_3_output_0_splitncnn_0 /model.24/Constant_11_output_0 /model.24/Concat_2_output_0 0=0
Reshape          /model.24/Reshape_3      2 1 /model.24/Reshape_1_output_0_splitncnn_0 /model.24/Concat_2_output_0 /model.24/Reshape_3_output_0
Expand           /model.24/Expand         2 1 /model.24/Reshape_3_output_0 /model.24/Concat_1_output_0_splitncnn_1 /model.24/Expand_output_0
Concat           /model.24/Concat_3       2 1 /model.24/Constant_12_output_0 /model.24/Shape_4_output_0_splitncnn_0 /model.24/Concat_3_output_0 0=0
Reshape          /model.24/Reshape_4      2 1 /model.24/Reshape_2_output_0_splitncnn_0 /model.24/Concat_3_output_0 /model.24/Reshape_4_output_0
Expand           /model.24/Expand_1       2 1 /model.24/Reshape_4_output_0 /model.24/Concat_1_output_0_splitncnn_0 /model.24/Expand_1_output_0
ExpandDims       /model.24/Unsqueeze_3    2 1 /model.24/Expand_1_output_0 /model.24/Constant_13_output_0 /model.24/Unsqueeze_3_output_0 -23303=0
ExpandDims       /model.24/Unsqueeze_4    2 1 /model.24/Expand_output_0 /model.24/Constant_14_output_0 /model.24/Unsqueeze_4_output_0 -23303=0
Concat           /model.24/Concat_4       2 1 /model.24/Unsqueeze_3_output_0 /model.24/Unsqueeze_4_output_0 /model.24/Concat_4_output_0 0=1
ExpandDims       /model.24/Unsqueeze_5    2 1 /model.24/Gather_1_output_0_splitncnn_2 /model.24/Constant_17_output_0 /model.24/Unsqueeze_5_output_0 -23303=0
ExpandDims       /model.24/Unsqueeze_6    2 1 /model.24/Gather_2_output_0_splitncnn_2 /model.24/Constant_18_output_0 /model.24/Unsqueeze_6_output_0 -23303=0
Concat           /model.24/Concat_5       5 1 /model.24/Constant_15_output_0 /model.24/Constant_16_output_0 /model.24/Unsqueeze_5_output_0 /model.24/Unsqueeze_6_output_0 /model.24/Constant_19_output_0 /model.24/Concat_5_output_0 0=0
Reshape          /model.24/Reshape_5      1 1 /model.24/Concat_5_output_0 /model.24/Reshape_5_output_0 0=-1
Split            splitncnn_34             1 3 /model.24/Reshape_5_output_0 /model.24/Reshape_5_output_0_splitncnn_0 /model.24/Reshape_5_output_0_splitncnn_1 /model.24/Reshape_5_output_0_splitncnn_2
Shape            /model.24/Shape_5        1 1 /model.24/Reshape_5_output_0_splitncnn_2 /model.24/Shape_5_output_0
ConstantOfShape  /model.24/ConstantOfShape 1 1 /model.24/Shape_5_output_0 /model.24/ConstantOfShape_output_0
Split            splitncnn_35             1 2 /model.24/ConstantOfShape_output_0 /model.24/ConstantOfShape_output_0_splitncnn_0 /model.24/ConstantOfShape_output_0_splitncnn_1
BinaryOp         /model.24/Mul            2 1 /model.24/ConstantOfShape_output_0_splitncnn_1 /model.24/Constant_21_output_0 /model.24/Mul_output_0 0=2
Equal            /model.24/Equal          2 1 /model.24/Reshape_5_output_0_splitncnn_1 /model.24/Mul_output_0 /model.24/Equal_output_0
Where            /model.24/Where          3 1 /model.24/Equal_output_0 /model.24/ConstantOfShape_output_0_splitncnn_0 /model.24/Reshape_5_output_0_splitncnn_0 /model.24/Where_output_0
Expand           /model.24/Expand_2       2 1 /model.24/Concat_4_output_0 /model.24/Where_output_0 /model.24/Expand_2_output_0
BinaryOp         /model.24/Sub            1 1 /model.24/Expand_2_output_0 /model.24/Sub_output_0 0=1 1=1 2=5.000000e-01
ExpandDims       /model.24/Unsqueeze_7    2 1 /model.24/Gather_1_output_0_splitncnn_1 /model.24/Constant_25_output_0 /model.24/Unsqueeze_7_output_0 -23303=0
ExpandDims       /model.24/Unsqueeze_8    2 1 /model.24/Gather_2_output_0_splitncnn_1 /model.24/Constant_26_output_0 /model.24/Unsqueeze_8_output_0 -23303=0
Concat           /model.24/Concat_6       5 1 /model.24/Constant_23_output_0 /model.24/Constant_24_output_0 /model.24/Unsqueeze_7_output_0 /model.24/Unsqueeze_8_output_0 /model.24/Constant_27_output_0 /model.24/Concat_6_output_0 0=0
Reshape          /model.24/Reshape_6      1 1 /model.24/Concat_6_output_0 /model.24/Reshape_6_output_0 0=-1
Split            splitncnn_36             1 3 /model.24/Reshape_6_output_0 /model.24/Reshape_6_output_0_splitncnn_0 /model.24/Reshape_6_output_0_splitncnn_1 /model.24/Reshape_6_output_0_splitncnn_2
Shape            /model.24/Shape_6        1 1 /model.24/Reshape_6_output_0_splitncnn_2 /model.24/Shape_6_output_0
ConstantOfShape  /model.24/ConstantOfShape_1 1 1 /model.24/Shape_6_output_0 /model.24/ConstantOfShape_1_output_0
Split            splitncnn_37             1 2 /model.24/ConstantOfShape_1_output_0 /model.24/ConstantOfShape_1_output_0_splitncnn_0 /model.24/ConstantOfShape_1_output_0_splitncnn_1
BinaryOp         /model.24/Mul_1          2 1 /model.24/ConstantOfShape_1_output_0_splitncnn_1 /model.24/Constant_29_output_0 /model.24/Mul_1_output_0 0=2
Equal            /model.24/Equal_1        2 1 /model.24/Reshape_6_output_0_splitncnn_1 /model.24/Mul_1_output_0 /model.24/Equal_1_output_0
Where            /model.24/Where_1        3 1 /model.24/Equal_1_output_0 /model.24/ConstantOfShape_1_output_0_splitncnn_0 /model.24/Reshape_6_output_0_splitncnn_0 /model.24/Where_1_output_0
Expand           /model.24/Expand_3       2 1 onnx::Expand_747 /model.24/Where_1_output_0 /model.24/Expand_3_output_0
Slice            /model.24/Split          2 4 /model.24/Transpose_output_0 onnx::Split_452_splitncnn_2 /model.24/Split_output_0 /model.24/Split_output_1 /model.24/Split_output_2 /model.24/Split_output_3 -23300=4,-233,-233,-233,-233 1=3
Sigmoid          /model.24/Sigmoid        1 1 /model.24/Split_output_0 /model.24/Sigmoid_output_0
BinaryOp         /model.24/Mul_2          1 1 /model.24/Sigmoid_output_0 /model.24/Mul_2_output_0 0=2 1=1 2=2.000000e+00
BinaryOp         /model.24/Add            2 1 /model.24/Mul_2_output_0 /model.24/Sub_output_0 /model.24/Add_output_0 0=0
BinaryOp         /model.24/Mul_3          1 1 /model.24/Add_output_0 /model.24/Mul_3_output_0 0=2 1=1 2=8.000000e+00
Sigmoid          /model.24/Sigmoid_1      1 1 /model.24/Split_output_1 /model.24/Sigmoid_1_output_0
BinaryOp         /model.24/Mul_4          1 1 /model.24/Sigmoid_1_output_0 /model.24/Mul_4_output_0 0=2 1=1 2=2.000000e+00
BinaryOp         /model.24/Pow            1 1 /model.24/Mul_4_output_0 /model.24/Pow_output_0 0=6 1=1 2=2.000000e+00
BinaryOp         /model.24/Mul_5          2 1 /model.24/Pow_output_0 /model.24/Expand_3_output_0 /model.24/Mul_5_output_0 0=2
Sigmoid          /model.24/Sigmoid_2      1 1 /model.24/Split_output_2 /model.24/Sigmoid_2_output_0
Concat           /model.24/Concat_7       4 1 /model.24/Mul_3_output_0 /model.24/Mul_5_output_0 /model.24/Sigmoid_2_output_0 /model.24/Split_output_3 /model.24/Concat_7_output_0 0=3
BinaryOp         /model.24/Mul_6          2 1 /model.24/Gather_2_output_0_splitncnn_0 /model.24/Constant_34_output_0 /model.24/Mul_6_output_0 0=2
BinaryOp         /model.24/Mul_7          2 1 /model.24/Mul_6_output_0 /model.24/Gather_1_output_0_splitncnn_0 /model.24/Mul_7_output_0 0=2
ExpandDims       /model.24/Unsqueeze_9    2 1 /model.24/Gather_output_0_splitncnn_0 onnx::Unsqueeze_474 /model.24/Unsqueeze_9_output_0 -23303=0
ExpandDims       /model.24/Unsqueeze_10   2 1 /model.24/Mul_7_output_0 onnx::Unsqueeze_476 /model.24/Unsqueeze_10_output_0 -23303=0
Concat           /model.24/Concat_8       3 1 /model.24/Unsqueeze_9_output_0 /model.24/Unsqueeze_10_output_0 /model.24/Constant_35_output_0 /model.24/Concat_8_output_0 0=0
Reshape          /model.24/Reshape_7      2 1 /model.24/Concat_7_output_0 /model.24/Concat_8_output_0 /model.24/Reshape_7_output_0
Convolution      /model.24/m.1/Conv       1 1 /model.20/cv3/act/Mul_output_0_splitncnn_0 /model.24/m.1/Conv_output_0 0=351 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=44928
Split            splitncnn_38             1 4 /model.24/m.1/Conv_output_0 /model.24/m.1/Conv_output_0_splitncnn_0 /model.24/m.1/Conv_output_0_splitncnn_1 /model.24/m.1/Conv_output_0_splitncnn_2 /model.24/m.1/Conv_output_0_splitncnn_3
Shape            /model.24/Shape_7        1 1 /model.24/m.1/Conv_output_0_splitncnn_3 /model.24/Shape_7_output_0
Crop             /model.24/Gather_3       1 1 /model.24/Shape_7_output_0 /model.24/Gather_3_output_0 -23309=1,0 -23310=1,1 -23311=1,-1
Split            splitncnn_39             1 2 /model.24/Gather_3_output_0 /model.24/Gather_3_output_0_splitncnn_0 /model.24/Gather_3_output_0_splitncnn_1
Shape            /model.24/Shape_8        1 1 /model.24/m.1/Conv_output_0_splitncnn_2 /model.24/Shape_8_output_0
Crop             /model.24/Gather_4       1 1 /model.24/Shape_8_output_0 /model.24/Gather_4_output_0 -23309=1,2 -23310=1,3 -23311=1,-1
Split            splitncnn_40             1 5 /model.24/Gather_4_output_0 /model.24/Gather_4_output_0_splitncnn_0 /model.24/Gather_4_output_0_splitncnn_1 /model.24/Gather_4_output_0_splitncnn_2 /model.24/Gather_4_output_0_splitncnn_3 /model.24/Gather_4_output_0_splitncnn_4
Shape            /model.24/Shape_9        1 1 /model.24/m.1/Conv_output_0_splitncnn_1 /model.24/Shape_9_output_0
Crop             /model.24/Gather_5       1 1 /model.24/Shape_9_output_0 /model.24/Gather_5_output_0 -23309=1,3 -23310=1,4 -23311=1,-1
Split            splitncnn_41             1 5 /model.24/Gather_5_output_0 /model.24/Gather_5_output_0_splitncnn_0 /model.24/Gather_5_output_0_splitncnn_1 /model.24/Gather_5_output_0_splitncnn_2 /model.24/Gather_5_output_0_splitncnn_3 /model.24/Gather_5_output_0_splitncnn_4
ExpandDims       /model.24/Unsqueeze_11   2 1 /model.24/Gather_3_output_0_splitncnn_1 onnx::Unsqueeze_492 /model.24/Unsqueeze_11_output_0 -23303=0
ExpandDims       /model.24/Unsqueeze_12   2 1 /model.24/Gather_4_output_0_splitncnn_4 onnx::Unsqueeze_498 /model.24/Unsqueeze_12_output_0 -23303=0
ExpandDims       /model.24/Unsqueeze_13   2 1 /model.24/Gather_5_output_0_splitncnn_4 onnx::Unsqueeze_500 /model.24/Unsqueeze_13_output_0 -23303=0
Concat           /model.24/Concat_9       5 1 /model.24/Unsqueeze_11_output_0 /model.24/Constant_39_output_0 /model.24/Constant_40_output_0 /model.24/Unsqueeze_12_output_0 /model.24/Unsqueeze_13_output_0 /model.24/Concat_9_output_0 0=0
Reshape          /model.24/Reshape_8      2 1 /model.24/m.1/Conv_output_0_splitncnn_0 /model.24/Concat_9_output_0 /model.24/Reshape_8_output_0
Permute          /model.24/Transpose_1    1 1 /model.24/Reshape_8_output_0 /model.24/Transpose_1_output_0 0=1
Cast             /model.24/Cast_2         1 1 /model.24/Gather_4_output_0_splitncnn_3 /model.24/Cast_2_output_0
Range            /model.24/Range_2        3 1 /model.24/Constant_41_output_0 /model.24/Cast_2_output_0 /model.24/Constant_42_output_0 /model.24/Range_2_output_0
Cast             /model.24/Cast_3         1 1 /model.24/Gather_5_output_0_splitncnn_3 /model.24/Cast_3_output_0
Range            /model.24/Range_3        3 1 /model.24/Constant_43_output_0 /model.24/Cast_3_output_0 /model.24/Constant_44_output_0 /model.24/Range_3_output_0
Reshape          /model.24/Reshape_9      1 1 /model.24/Range_2_output_0 /model.24/Reshape_9_output_0 0=-1
Split            splitncnn_42             1 2 /model.24/Reshape_9_output_0 /model.24/Reshape_9_output_0_splitncnn_0 /model.24/Reshape_9_output_0_splitncnn_1
Reshape          /model.24/Reshape_10     1 1 /model.24/Range_3_output_0 /model.24/Reshape_10_output_0 0=-1
Split            splitncnn_43             1 2 /model.24/Reshape_10_output_0 /model.24/Reshape_10_output_0_splitncnn_0 /model.24/Reshape_10_output_0_splitncnn_1
Shape            /model.24/Shape_10       1 1 /model.24/Reshape_9_output_0_splitncnn_1 /model.24/Shape_10_output_0
Split            splitncnn_44             1 2 /model.24/Shape_10_output_0 /model.24/Shape_10_output_0_splitncnn_0 /model.24/Shape_10_output_0_splitncnn_1
Shape            /model.24/Shape_11       1 1 /model.24/Reshape_10_output_0_splitncnn_1 /model.24/Shape_11_output_0
Split            splitncnn_45             1 2 /model.24/Shape_11_output_0 /model.24/Shape_11_output_0_splitncnn_0 /model.24/Shape_11_output_0_splitncnn_1
Concat           /model.24/Concat_10      2 1 /model.24/Shape_10_output_0_splitncnn_1 /model.24/Shape_11_output_0_splitncnn_1 /model.24/Concat_10_output_0 0=0
Split            splitncnn_46             1 2 /model.24/Concat_10_output_0 /model.24/Concat_10_output_0_splitncnn_0 /model.24/Concat_10_output_0_splitncnn_1
